Revit 2024 API
FormatOptions.IsValidAccuracy Method (Double)
 Checks whether an accuracy is valid for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsValidAccuracy(
	double accuracy
)
Visual Basic
Public Function IsValidAccuracy ( _
	accuracy As Double _
) As Boolean
Visual C++
public:
bool IsValidAccuracy(
	double accuracy
)
Parameters
accuracy
Type: System.Double
 The accuracy to check.
Return Value
 True if the accuracy is valid, false otherwise.
Remarks
 See the Accuracy property for details on valid accuracy values.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
IsValidAccuracy Overload
Autodesk.Revit.DB Namespace